import { PersonData, Vector } from './types';

export const guestData: PersonData[] = [
    {
        hash: '044adea5',
        names: 'Женя и Полина',
        welcome: `
        <p>Отложите стройку, забудьте о делах на время, потому что мы хотим, чтобы вы были нашими особыми гостями на свадьбе! Мы искренне ценим вашу дружбу и присутствие в нашей жизни, и не можем представить наш важный день без вас. Поэтому с огромной радостью приглашаем вас разделить этот незабываемый момент с нами.</p>

        <p>Мы понимаем, что у вас может быть много дел и обязанностей, но мы надеемся, что вы найдете возможность присутствовать на нашей свадьбе. Мы уверены, что ваше присутствие сделает этот день еще более особенным и запоминающимся.</p>

        <p>Пожалуйста, подтвердите свое участие, дайте нам знать, что вы будете с нами, и оставьте все заботы за пределами свадебной атмосферы. Мы гарантируем вам отличное время, хорошую компанию, веселую музыку и прекрасное настроение!</p>

        <p>Мы организуем все необходимое для вашего комфорта и удовольствия, поэтому пожалуйста, сообщите нам о возможных особых требованиях или пожеланиях. Мы хотим, чтобы вы чувствовали себя как дома и наслаждались каждым моментом нашей свадьбы.</p>

        <p>С нетерпением ждем вашего ответа и надеемся, что вы скажете "Да!" на наше приглашение. Мы уже представляем, как вы будете рядом с нами, делая этот день еще более особенным и запоминающимся.</p>
        `,
        accept_script_id: 'AKfycbyOy53ZUFKptENk1Rc7p36VdPFgEpjRbqEKF8bNWQ3ms0RELUKtuFBl2TozEAijxfCQ',
        decline_script_id: 'AKfycbweit0DiOvNFSTRXA_azV_8Y7WVNhErMaEuD4wZCo0_DbV4srLN4ye_byGbMqU5vKb6',
        pair: true,
    },
    {
        hash: '1c867f21',
        names: 'Витя и Даша',
        welcome: `
        <p>Мы хотим пригласить вас на нашу свадьбу, чтобы вы присоединились к нам и помогли создать незабываемую атмосферу вечера! Мы знаем, что вы обладаете непревзойденным чувством юмора и яркой энергией, и поэтому очень хотим видеть вас в числе наших гостей.</p>

        <p>Этот вечер будет полон радости, танцев и веселья, и мы не можем себе представить его без вашей компании. Вас ждут зажигательные музыкальные хиты, вкусная еда и, конечно же, много веселья на танцполе. Мы уверены, что вы сделаете этот день еще более запоминающимся и оставите след в наших сердцах.</p>

        <p>Поэтому, пожалуйста, не отказывайтесь от нашего приглашения и присоединяйтесь к нам, чтобы тусить, веселиться и наслаждаться этим особым моментом вместе с нами. Мы хотим, чтобы наша свадьба стала для вас ярким и радостным воспоминанием, которое будет согревать ваше сердце еще долгие годы.</p>

        <p>Мы с нетерпением ждем вашего ответа и надеемся услышать "Да!" на наше приглашение. Давайте создадим незабываемые воспоминания вместе и оторвемся по полной программе на нашей свадьбе!</p>
        `,
        accept_script_id: 'AKfycbzC795iVOsfkhaI299mC29F-cnIOuD6jWkV93zqccmciosAb13wV9lTYnJ9pSenH98',
        decline_script_id: 'AKfycbymraPQxFO1rEJd7W2c_eeDbpaj7r4lWlN3KJfm3V0B_YFW38kp01T5_QPPaF4Aw_11',
        pair: true,
    },
    {
        hash: '6bca9b82',
        names: 'Артём и Настя',
        welcome: `
        <p>С большим теплом и радостью мы хотим пригласить вас на нашу свадьбу! Ваше присутствие всегда создает особую атмосферу уюта и радости. Мы ценим наши встречи и путешествия вместе, которые наполнены яркими и незабываемыми моментами.</p>

        <p>Мы знаем, что у нас много общих увлечений, и одно из них - наша общая любовь к котам. Мы всегда с удовольствием обмениваемся историями о наших пушистых друзьях и смеемся над их шалостями. Кроме того, мы знаем, что ночи, проведенные вместе, становятся особенно запоминающимися и позволяют нам окунуться в мир беззаботного веселья и отдыха.</p>

        <p>Поэтому мы с нетерпением ждем возможности поделиться с вами этим особенным днем в нашей жизни. Мы хотим, чтобы вы были рядом, чтобы вместе создать много незабываемых моментов, наполненных улыбками, смехом и радостью.</p>

        <p>Пожалуйста, примите наше приглашение и станьте частью нашей свадьбы. Вместе мы сможем создать волшебную атмосферу, наполненную любовью и дружбой.</p>
        `,
        accept_script_id: 'AKfycbyDERXSrCTqXqsxKq2G3Q0MdY8z1dYZBi2YbuFmAnZYIZtN55Th2uhg1B73Xc6VIL5z',
        decline_script_id: 'AKfycbxTmQzGDV6DOQic_LjL8Nms9Cxu6kAHVN4HWVveoKjvJR6pDHuP1qos6H_zGAxy7bSh',
        pair: true,
    },
    {
        hash: 'e940c2a6',
        names: 'Серыч и Катя',
        welcome: `
        <p>С радостью обращаемся к вам с особенным приглашением на нашу свадьбу. Мы уже давно не виделись, и скучаем по нашим приятным встречам. Хотелось бы снова собраться вместе и провести время в дружеской и радостной атмосфере.</p>

        <p>Мы знаем, что у вас есть способность превращать обычные моменты в особенные и запоминающиеся. Мы искренне надеемся, что вы присоединитесь к нам на свадьбе и добавите свой неповторимый шарм в наше счастливое событие.</p>

        <p>Будем рады поделиться с вами волнением и радостью этого особого дня. Ваше присутствие будет для нас важным и особенным моментом. Давайте воссоединимся и создадим новые воспоминания, которые будут связывать нас на протяжении многих лет.</p>

        <p>Пожалуйста, примите наше приглашение и отведайте с нами вкус радости и счастья в этот особый день. Мы с нетерпением ждем возможности увидеть вас и провести время вместе.</p>

        <p>Если у вас возникнут какие-либо вопросы или вам потребуется дополнительная информация, не стесняйтесь обращаться к нам. Мы всегда готовы помочь и ответить на все ваши запросы.</p>
        `,
        accept_script_id: 'AKfycbxC2AAzxo8h_PHISOEtrtAthKQRSyr59UTqjWQ83YttiS8fSVODJLhAXdy1f-QldB9G',
        decline_script_id: 'AKfycbwPoKP_91ssS4bP6stOxur1lz3PObyOmvYRFuDVDPLRq9XX_PxRFtZnIDUAP_Mddxw-',
        pair: true,
    },
    {
        hash: '71def424',
        names: 'Ринат и Юля',
        welcome: `
        <p>Мы рады пригласить вас на нашу свадьбу, чтобы вы разделили с нами этот особенный день, полный любви и радости. Ваше присутствие для нас очень важно, и мы хотим, чтобы вы стали частью этого незабываемого события.</p>

<p>Мы хотим проинформировать вас, что вместо чак-чака, будет подается вкусный свадебный торт, который мы с нетерпением ждем, чтобы разделить его со всеми нашими гостями. Однако, Ринат, мы просим вас быть осторожным и не брать в руки нож, поскольку это может представлять опасность. Будут профессиональные официанты, которые заботливо разрежут торт и подадут его каждому гостю.</p>

<p>Мы искренне надеемся, что вы сможете присоединиться к нам в этот особенный день. Будет много веселья, танцев и радостных моментов, которые мы хотим разделить с вами. Пожалуйста, примите наше приглашение и дайте нам знать о вашем присутствии.</p>

<p>Если у вас есть какие-либо вопросы или пожелания, не стесняйтесь обратиться к нам. Мы с нетерпением ждем вашего ответа и с удовольствием встретим вас на нашей свадьбе.</p>
`,
        accept_script_id: 'AKfycbwOaPJi3WU9wu2TTFCYfn5yXBac0qU2mP5t-iWs1VIHBFQyTKQwlRSmczcR09Q3MyDr',
        decline_script_id: 'AKfycbwj9mBPQ6M22VqAhc_AeET6hjmu3uIrESKCmpxznKZgs-d4iKpSbC_1YA8JW1uq7ZIc',
        pair: true,
    },
    {
        hash: '6ad0800b',
        names: 'Глеб и Алёна',
        welcome: `
        <p>С радостью обращаемся к вам с особым приглашением на нашу свадьбу. Мы знаем, что у вас замечательное чувство юмора и любовь к приключениям, поэтому мы приготовили несколько особенных сюрпризов.</p>

        <p>Глеб, ты, конечно, знаком со знаменитой "студией полного цикла Романа Баранова", но наша свадьба представляет собой совершенно новую "студию полного цикла свадебных приключений"! Вместе мы создадим незабываемые моменты и запечатлим каждую радостную эмоцию этого особенного дня.</p>

        <p>Алёна, наша свадьба будет не только полна веселья, но и загадками удачи! Мы организуем захватывающую лотерею с призовым фондом в 50 тысяч марсюшиков! Так что не забудьте принести свою удачу и готовьтесь к захватывающей битве за замечательные призы.</p>

        <p>Мы искренне приглашаем вас разделить этот особый день с нами. Ваше присутствие будет для нас большой радостью и сделает нашу свадьбу ещё более запоминающейся и веселой.</p>

        <p>Пожалуйста, примите наше приглашение и отправьтесь вместе с нами в увлекательное путешествие свадебных приключений. Мы с нетерпением ждем встречи с вами и незабываемых моментов, которые будем разделять вместе.</p>

        <p>Если у вас возникнут вопросы или пожелания, не стесняйтесь обращаться к нам. Мы всегда готовы помочь и создать незабываемый опыт нашей свадьбы.</p>
        `,
        accept_script_id: 'AKfycbx87PzYLRloxJUA5L1fYNDUtaD-951T46qnTpJ05VEKNo1CeVvuG_o_Q7BdFlCAqR9z',
        decline_script_id: 'AKfycbyZpvFe8uCfJwXYYCtbSC9iTqsI1eRt45xszSW9QiKv_umkwHK_r-7OdyfkVqEBKBHn',
        pair: true,
    },
    {
        hash: '44113cd1',
        names: 'Артём и Юля',
        welcome: `
        <p>С большой радостью и теплотой мы обращаемся к вам с особым приглашением на нашу свадьбу! Мы знаем, что вы - прекрасная семья, и ваше присутствие на этом особенном дне имеет для нас огромное значение.</p>
        <p>Артем, твой талант игры на укулеле и умение создавать удивительные вещи своими руками из кожи не перестают нас восхищать. Твоя музыкальная атмосфера и прекрасные изделия создают особую ауру вокруг тебя. Мы надеемся, что ты поделишься своими мелодиями и умениями с нами в этот особенный день.</p>
        <p>Юля, твой позитивный и открытый настрой всегда заряжает нас хорошим настроением и энергией. Твоя способность всегда зажигать и поднимать настроение окружающим - настоящий дар. Мы уверены, что твоя улыбка и жизнелюбие добавят в нашу свадьбу еще больше радости и счастья.</p>
        <p>Мы приглашаем вас присоединиться к нам в этом особом путешествии свадебных эмоций. Мы хотим, чтобы этот день стал для нас всеми запоминающимся и наполненным любовью, радостью и незабываемыми моментами. Ваше присутствие сделает нашу свадьбу еще более особенной и значимой.</p>
        <p>Пожалуйста, примите наше приглашение и отправьтесь вместе с нами в этот удивительный праздник. Мы с нетерпением ждем встречи с вами и с нетерпением ожидаем момента, когда сможем разделить счастье и радость этого особого дня.</p>
        `,
        accept_script_id: 'AKfycbwG5MU_BTkGF8bF5m17-b2sLJQg9DVw4ZjTw_YszGlxW9cbCi2A16ESGMAyqwY69sGq',
        decline_script_id: 'AKfycbzGyeIG8XYqoPm_Az8t8EOQ2jLWry9WJu7FLsiXxy9RhSEsW1N1LMvZke6-UPOhbmWT',
        pair: true,
    },
    {
        hash: '30718bb7',
        names: 'Андрей и Даша',
        welcome: `
 <p>Мы с огромным восторгом и радостью хотим пригласить вас на нашу свадьбу! Ваша харизма, веселый нрав и неподдельная радость жизни делают наши встречи незабываемыми. Андрей, твоя харизма и остроумие вносят яркость в любую компанию. Даша, твоя любовь к танцам и заразительный смех поднимают настроение каждому вокруг.</p>

<p>Мы не можем себе представить этот особенный день без вас. Мы хотим разделить с вами радость, смех и танцы на нашей свадьбе. Ваше присутствие сделает этот день еще более волшебным и запоминающимся.</p>

<p>Пожалуйста, примите наше приглашение и станьте частью этого особого события в нашей жизни. Мы ждем с нетерпением встречи с вами, чтобы вместе создать незабываемые моменты, наполненные радостью и счастьем.</p>
        `,
        accept_script_id: 'AKfycbxjEf7l996zCDabkqJrxjD5ZXg-YMMKrxuJPsPXObPGRS6Sjrqw_6WLfe3Kl3OdFHEX',
        decline_script_id: 'AKfycbza7UWzXhxtFoLj-Ty04PtFBlPnTnIJ6nz2JiAthupzUk08azWs6J5UtC9zF7qeWxM',
        pair: true,
    },
    {
        hash: '4bf671ff',
        names: 'Никита и Лиза',
        welcome: `
        <p>Мы рады пригласить вас на нашу свадьбу, чтобы вы разделили с нами этот особенный день, наполненный любовью и радостью. Мы знаем, что для Никиты эта свадьба будет особенной возможностью поучаствовать в качестве отдыхающего, и мы очень рады, что он сможет насладиться этим днем в полной мере.</p>

<p>А Лизе хотим сказать: не нужно сдерживать свой смех! В этот день вы можете не скромно хихикать, а безудержно смеяться вместе с нами. Мы хотим, чтобы каждый момент нашей свадьбы был наполнен радостью и смехом, и ваша поддержка и веселое настроение нам очень важны.</p>

<p>Мы искренне надеемся, что вы сможете присоединиться к нам. Будет много смеха, танцев и незабываемых моментов, которыми мы хотим поделиться с вами. Пожалуйста, примите наше приглашение и дайте нам знать о вашем присутствии.</p>

<p>Если у вас возникнут вопросы или вам потребуется дополнительная информация, не стесняйтесь обратиться к нам. Мы с нетерпением ждем вашего ответа и с удовольствием встретим вас на нашей свадьбе.</p>
`,
        accept_script_id: 'AKfycbyxUPMsq3N7gyG2OMn-2pR0Zoep0Y5S-BJLWo-3zjsXJf5xgtGZDAxpU78_YDjI_XVM',
        decline_script_id: 'AKfycbyiBZRM1Rg9h6FI0pLInRcpvUImfuTK1Y6xG-Ne_jTRnZYZd2EdewiqOxV1AsBflQNu',
        pair: true,
    },
    {
        hash: 'b36c8224',
        names: 'Лёха и Катя',
        welcome: `
        <p>Мы счастливы пригласить вас на нашу свадьбу, чтобы вы разделили с нами этот особенный день, наполненный любовью, радостью и безудержным весельем. Мы знаем, что у Лёхи есть своя особая энергия, и мы хотим, чтобы он не принижал институт брака, а наоборот, пустил всю эту пьяную энергию в конкурсы и танцы!</p>

        <p>Мы не сомневаемся, что с Лёхиным задором и танцевальными талантами наша свадебная вечеринка станет еще более яркой и запоминающейся. Мы будем счастливы видеть, как вы вместе веселитесь и создаете незабываемые моменты на танцполе.</p>

        <p>Мы искренне надеемся, что вы сможете присоединиться к нам. Будет много конкурсов, танцев и радостных моментов, которыми мы хотим поделиться с вами. Пожалуйста, примите наше приглашение и дайте нам знать о вашем присутствии.</p>

        <p>Если у вас возникнут вопросы или вам потребуется дополнительная информация, не стесняйтесь обратиться к нам. Мы с нетерпением ждем вашего ответа и с удовольствием встретим вас на нашей свадьбе.</p>
        `,
        accept_script_id: 'AKfycbzachyLKg8G5JUGBH41WHFkaRCvITivVTqzvSEAI5Y4lDScOpd12QXwmIribYjuYrE3',
        decline_script_id: 'AKfycbxThvNehbS8ILe_DoTlfwQ8FISmxpYdEt5rKP7LtbopqyS93LJDejQxESlV_yPwEgpu',
        pair: true,
    },
    {
        hash: 'd7a3b130',
        names: 'Паша и Влада',
        welcome: `
        <p>Мы рады пригласить вас на нашу свадьбу, чтобы вы разделили с нами этот особенный день, наполненный любовью, радостью и незабываемыми моментами. У нас для вас особые роли, которые мы хотим подчеркнуть.</p>

        <p>Паша, тебе предстоит выпустить зверя! Мы знаем, что у тебя есть опыт с корпоративных вечеринок, и мы хотим, чтобы ты привнес эту неповторимую энергию и азарт на нашу свадьбу. Так что давай развлечемся и создадим незабываемые воспоминания вместе!</p>

        <p>А Влада, мы знаем, что ты настоящий огонек на танцполе! Мы приготовили для тебя специальные конкурсы и танцы, где ты сможешь зажигать и проявить все свои таланты. Мы с нетерпением ждем, чтобы увидеть, как ты будешь светиться и веселиться вместе с нами.</p>

        <p>Мы искренне надеемся, что вы сможете присоединиться к нам. Будет много веселья, смеха и незабываемых моментов, которыми мы хотим поделиться с вами. Пожалуйста, примите наше приглашение и дайте нам знать о вашем присутствии.</p>

        <p>Если у вас возникнут вопросы или вам потребуется дополнительная информация, не стесняйтесь обратиться к нам. Мы с нетерпением ждем вашего ответа и с удовольствием встретим вас на нашей свадьбе.</p>


        `,
        accept_script_id: 'AKfycbz9e8S64HcoGsG-Z-qXoe3tqTRRox9QSauDq-lWIyZHW-QeY-OMQSUPtxiL4R5uEhhH',
        decline_script_id: 'AKfycbxqqOXmW3Sn6ihCx44bk-CHYG0XSwo_RY_PjZ8FxdSSjXlnFFbZPbNdn3nFP7kPAAuW',
        pair: true,
    },
    {
        hash: '2b72bb68',
        names: 'Серёжа и Таня',
        welcome: `
        <p>Мы рады пригласить вас на нашу свадьбу, чтобы вы разделили с нами этот особенный день, наполненный любовью, радостью и незабываемыми моментами. Мы знаем, что у вас обоих есть особые таланты, которые мы хотим подчеркнуть.</p>

        <p>Таня, тебе предстоит взорвать танцпол! Мы знаем, что у тебя есть потрясающая харизма и танцевальные способности. Давай зажжем вместе и создадим невероятную атмосферу, в которой каждый гость не сможет устоять и будет присоединяться к твоему веселью и энергии!</p>

        <p>А Серёжа, мы знаем, что ты настоящий чемпион в конкурсах! Твои навыки и острый ум помогут тебе порвать всех соперников и покорить все конкурсы, которые мы подготовили на нашей свадьбе. Будь уверен, что твоя способность соревноваться и выигрывать будет приносить массу радости и восхищения всем присутствующим.</p>

        <p>Мы искренне надеемся, что вы сможете присоединиться к нам. Будет много веселья, танцев и незабываемых моментов, которыми мы хотим поделиться с вами. Пожалуйста, примите наше приглашение и дайте нам знать о вашем присутствии.</p>

        <p>Если у вас возникнут вопросы или вам потребуется дополнительная информация, не стесняйтесь обратиться к нам. Мы с нетерпением ждем вашего ответа и с удовольствием встретим вас на нашей свадьбе.</p>
        `,
        accept_script_id: 'AKfycbzGWJcrv4QzquGBvceWURb8ZkZlxx9laBmSXE75mxnnvDWm8TE6QQ6yOSfPd0fELmWy',
        decline_script_id: 'AKfycby15k5lilzRGunbi7cYO2aL0QZSRqeqauv8RZKHd_yu8FT2mgsaR36vrTj27cq7gssg',
        pair: true,
    },
    {
        hash: '0d47ab19',
        names: 'Дима и Надя',
        welcome: `
        <p>Мы рады пригласить вас на нашу свадьбу, чтобы вы разделили с нами этот волшебный момент, наполненный любовью, радостью и соревновательным духом. Мы знаем, что у вас обоих есть страсть к победе в конкурсах и азарт, которые мы хотим подчеркнуть.</p>

        <p>Вы образуете непобедимую команду! Дима и Надя, ваша любовь к соревнованиям и желание побеждать всегда вдохновляют нас. Мы создали специальные конкурсы на нашей свадьбе, где вы сможете проявить свои навыки и стать звездами вечера. Мы уверены, что ваша соревновательная природа и азарт превратят нашу свадьбу в незабываемое событие.</p>

        <p>Мы искренне надеемся, что вы сможете присоединиться к нам. Будет много веселья, соревнований и незабываемых моментов, которыми мы хотим поделиться с вами. Пожалуйста, примите наше приглашение и дайте нам знать о вашем присутствии.</p>

        <p>Если у вас возникнут вопросы или вам потребуется дополнительная информация, не стесняйтесь обратиться к нам. Мы с нетерпением ждем вашего ответа и с удовольствием встретим вас на нашей свадьбе.</p>


        `,
        accept_script_id: 'AKfycbz3fkAQxL3Ot5po1fqhEBpcw_NC0nWtRI6Cgh38lwauuk6aDrRIKy3VRuAkcsHraAmR',
        decline_script_id: 'AKfycbwOu2EKtIg2dFhdv3_SdxS3hB8G_ShOH1aKhGr6cq_m_YgLAQuAk-ko05X01jfF-jk',
        pair: true,
    },
    {
        hash: '8d0815f7',
        names: 'Ростислав и Саша',
        welcome: `

<p>Мы счастливы поделиться с вами нашим важным моментом и хотим пригласить вас на нашу свадьбу. Ваше присутствие на этом событии значит для нас очень много, и мы надеемся, что сможете присоединиться к нам в этот особый день.</p>

<p>Тем не менее, у нас возникла небольшая ситуация, которую мы хотели бы с вами поделиться. К сожалению, наш нанятый шашлычник внезапно отказался прийти на свадьбу, и нам необходимо найти решение. И вот мы подумали, что Ростислав, как наш эксперт по шашлыкам, может взять на себя эту важную роль!</p>

<p>Так что, Ростислав, мы будем очень рады, если вы сможете стать нашим главным шашлычником в этот день и порадовать всех гостей вашими невероятно вкусными шашлыками. Мы знаем, что вы профессионал в этом деле, и ваше участие сделает нашу свадьбу еще более запоминающейся и вкусной.</p>

<p>Пожалуйста, дайте нам знать, сможете ли вы принять эту задачу и стать нашим шашлычником на свадьбе. Мы с нетерпением ждем вашего ответа.</p>

`,
        accept_script_id: 'AKfycbyJdGxBBfPIp3UO8H-a9pZPEFz-I6aravmLK5cWUU2XFYpy_Dz6BChWSc78aQbs_fa1',
        decline_script_id: 'AKfycbzxJgLjNYIyIJ9qPNdmnybgwdmPm49R8yG28CwxSTlI1ESbdtyT1NJEMB_mAfOz-oH1',
        pair: true,
    },
    {
        hash: 'b862117f',
        names: 'Артём и Катя',
        welcome: `
        <p>Мы с большой радостью обращаемся к вам с особым приглашением на нашу свадьбу. Вы - не только наши дорогие друзья, но и невероятно талантливые люди. Мы знаем, что вы обладаете уникальной способностью развеселить и вдохновить всех вокруг себя.</p>
        <p>Артём, твое мастерство в музыке и танцах не знает границ. Твои выступления всегда поражают нас своей энергией и талантом. Мы просим тебя не выигрывать слишком ярко в наших музыкально-танцевальных конкурсах, иначе все наши гости останутся без призов! Давай разделим этот день счастья и веселья, оставляя шанс другим участникам.</p>
        <p>Катя, ты - настоящая принцесса танцпола. Твоя грация и красота не оставляют равнодушными. Танцуй, как будто никто не смотрит, и позволь всем окунуться в магию своих движений. Мы уверены, что ты будешь восхитительна, но помни, что нам нужно оставить немного победных моментов другим гостям.</p>
        <p>Мы приглашаем вас присоединиться к нам и поделиться этим особым днем, наполненным любовью, радостью и незабываемыми моментами. Мы уверены, что ваше присутствие сделает нашу свадьбу еще более яркой и запоминающейся.</p>
        <p>Пожалуйста, примите наше приглашение и отправьтесь вместе с нами в увлекательное путешествие свадебных эмоций. Мы с нетерпением ждем встречи с вами и незабываемых моментов, которые будем разделять вместе.</p>
        <p>Если у вас возникнут вопросы или пожелания, не стесняйтесь обращаться к нам. Мы всегда готовы помочь и создать незабываемый опыт нашей свадьбы.</p>
        `,
        accept_script_id: 'AKfycbydSm4pd_4uWK2ukkjz4wbzfKHWWgg6DB8vnPcEKDOSMNAjJQU--r__46NdQpmSKTs_',
        decline_script_id: 'AKfycbyHgcUbbWURnUNMsbAk4TUaDdKRakKKgg2zMM931usJb1VKglUVELtZaYSURcNIk27Q',
        pair: true,
    },
    {
        hash: '32384ebd',
        names: 'Никита и Соня',
        welcome: `
        <p>Мы рады поделиться с вами новостью о нашей свадьбе и пригласить вас стать частью этого особенного дня. Мы знаем, что у нас есть некоторые особенности и пожелания, которые хотим уточнить.</p>

<p>Никита, специально для тебя у нас будет отличная вишнёвая настойка, которую мы приготовили с большой любовью. Но помни, дорогой друг, важно умеренно насладиться этим напитком, чтобы ты не превратился в "ТЫ КРЫНЖ". Мы хотим, чтобы ты получил максимум удовольствия от вечера, но также остался веселым и в хорошем настроении, чтобы поделиться с нами этим знаменательным моментом.</p>

<p>Соня, мы знаем, что у тебя есть неподражаемый смех и радость, которые невозможно удержать. Мы хотим, чтобы ты не скромно хихикала, а безудержно смеялась вместе с нами. Твоя энергия и позитивное настроение помогут создать неповторимую атмосферу праздника и сделают нашу свадьбу еще более веселой и запоминающейся.</p>

<p>Пожалуйста, примите наше приглашение и дайте нам знать о вашем присутствии. Мы с нетерпением ждем, чтобы поделиться этим знаменательным днем с вами и создать незабываемые воспоминания вместе.</p>

<p>Если у вас возникнут вопросы или вам потребуется дополнительная информация, не стесняйтесь обратиться к нам. Мы с удовольствием ответим на все ваши вопросы.</p>
        `,
        accept_script_id: 'AKfycbypO8-9Kri6CxW1fGWrbE2QiCZXT21eFWvXmA5objW1vGOc5HmJKKEvnnDGTBzQZmC9',
        decline_script_id: 'AKfycbzAd84oRX7h3cV-0591y4fgckQulXEYbvV5tvPzhrEbMXr2UEs6dXI5tm07pOAxyblk',
        pair: true,
    },
    {
        hash: 'c543e9f4',
        names: 'Светлана и Алексей',
        welcome: `
        <p>С радостью обращаемся к вам с особенным приглашением на нашу свадьбу. Хотя мы редко общаемся, ваше присутствие на этом важном событии для нас имеет особое значение.</p>

        <p>Мы хотим, чтобы этот день был наполнен радостью, счастьем и праздником. И мы хотели бы разделить этот момент с вами, чтобы создать новые воспоминания и укрепить наши связи.</p>

        <p>Пожалуйста, примите наше приглашение и присоединитесь к нам на свадьбе. Мы будем счастливы видеть вас рядом с нами в этот особый день.</p>

        <p>Если у вас возникнут какие-либо вопросы или если вам потребуется дополнительная информация, пожалуйста, дайте нам знать. Мы с удовольствием ответим на все ваши запросы.</p>
        `,
        accept_script_id: 'AKfycbz410hxrhGT_BeruYsgtZVGQQdBMRiCqyyQ6SkSsfjyFzttvP7WNFRgPnSOUy2PlGl6',
        decline_script_id: 'AKfycbwZjXQXf4nkzGx1uWi2Vn0BcDwaynrdaBfRmC-PU-_Xi-REImpYphT6qUfWFBNy5R9M',
        pair: true,
    },
    {
        hash: '2b4a3ee0',
        names: 'Мама и Папа',
        welcome: '<3',
        accept_script_id: 'AKfycbwgd2ndScOyaaINf7tSx9uJHfoZqePA6TRZUHfmm4uldoLCyB7IJ1cgov_H1xhlV6On',
        decline_script_id: 'AKfycby9S9AbCe6S06Idbe5QOV67Gn5TxqjSlS45SW44YH4S5_WHwije7Od-2cAIHdp4F4zE',
        pair: true,
    },
    {
        hash: '9a1287fd',
        names: 'Тётя Зиля и Настя',
        welcome: `
            <p>Мы с большим волнением и радостью обращаемся к вам с особым приглашением на нашу свадьбу! Вы - особые люди для нас, и ваше присутствие на этом особенном дне будет для нас великой честью.</p>
            <p>Тетя Зиля, ваша преданность, надежность и способность всегда рассмешить как настоящего друга семьи - это то, что делает вас такими особенными. Вы не боитесь новых увлечений и ощущений, всегда готовы искренне радоваться жизни. Ваша любовь к детям и ваша забота заставляют нас ценить вас еще больше.</p>
            <p>Настя, ты - настоящий талант и умница. Твое виртуозное мастерство на скрипке оставляет нас восхищенными, и мы являемся большими фанатами твоих концертов, хоть и заочно. Твоя музыка наполняет наши сердца радостью и вдохновением.</p>
            <p>Мы хотим разделить с вами этот особенный день - нашу свадьбу. Мы верим, что ваше присутствие сделает этот день еще более особенным и запоминающимся. Мы хотим создать атмосферу радости, счастья и незабываемых моментов, которые будут связывать наши сердца на всю жизнь.</p>
            <p>Пожалуйста, примите наше искреннее приглашение и отправьтесь вместе с нами в это удивительное путешествие свадебных эмоций. Мы с нетерпением ждем встречи с вами и надеемся, что вы разделите с нами этот особенный день.</p>
        `,
        accept_script_id: 'AKfycbw5-Fuj5dQz21Q1yHWOrURbsBbrljjKiLSrkySEpFP5WxSzWuP0ens4FMyQnKB2Oc_P',
        decline_script_id: 'AKfycbxqLuLHulH7Zj4w6aMb5bKRX9PlOUCCTOab81JdzPuAbMeE7GrRDiIPVmMVHOCGBUfp',
        pair: true,
    },
    {
        hash: '0da7d2b8',
        names: 'Ирина',
        welcome: `
        <p>Мы искренне приглашаем вас на нашу свадьбу! Ваш задор, смех и яркая энергия нам так нужны в этот особенный день. Вы всегда привносите столько радости в нашу жизнь, и мы хотим, чтобы вы разделите с нами этот важный момент.</p>

        <p>Вас ждет веселая и дружеская атмосфера, полная смеха, танцев и радости. Мы знаем, что вы неотразимы на танцполе и умеете поднять настроение всем вокруг. Мы хотим, чтобы вы стали частью этого незабываемого вечера и помогли создать незабываемые моменты.</p>

        <p>Пожалуйста, не отказывайтесь от нашего приглашения и приезжайте к нам на свадьбу. Мы с нетерпением ждем вашего задора, смеха и ярких эмоций, которые вы принесете с собой. Давайте вместе отпразднуем этот важный день и создадим воспоминания, которые будут сопровождать нас всю жизнь.</p>


        `,
        accept_script_id: 'AKfycbzrVwih1l6R-xDkUcXQNgU19eiGXKIsQ4bEkuqDcrAoZwF4cusd3LGrTLEGA5GRE7vz',
        decline_script_id: 'AKfycbwH_YBUrX8FrbE6MxJ4SBbPUdsZRhqpxJaOA5y2Ty5AMou-MNOgPnUQkMBvmBIe05ZM',
        pair: false,
        pron: 'Дорогая',
    },
    {
        hash: 'ea786cde',
        names: 'Дима',
        welcome: `
        <p>С большим волнением и радостью мы обращаемся к тебе с особым приглашением на нашу свадьбу! Мы знаем, что у тебя очень занятой график и много дел, связанных с продвижением своей биржевой фирмы. Но наш особенный день приходится настолько близко к сердцу, что мы хотим попросить тебя отложить все дела на время и прийти от души порадоваться за нас.</p>
<p>Ты всегда был надежным другом и поддержкой для нас, и мы хотим, чтобы ты был рядом в этот особенный момент нашей жизни. Мы надеемся, что ты станешь настоящим рекордсменом по выпитым бокалам за наше счастье, и уйдешь с нашей свадьбы не только в приятном опьянении, но и с призами</p>
<p>Мы хотим, чтобы ты смог отдохнуть и насладиться этим днем вместе с нами. Мы приготовили для тебя много приятных сюрпризов, и мы знаем, что твое присутствие и поддержка добавят в нашу свадьбу особую искру и радость.</p>
<p>Пожалуйста, прими наше искреннее приглашение и отправься вместе с нами в это удивительное путешествие свадебных эмоций. Мы с нетерпением ждем встречи с тобой и надеемся, что ты сможешь насладиться этим днем, позволив себе отложить все дела и наслаждаться моментами радости и счастья.</p>
`,
        accept_script_id: 'AKfycbzfr0WWjNmHz9r2u3rU3qQZFb2jZIO2c3cFu8vv26Ht91pf6lOJoD0hpJZKPrPL0rhp',
        decline_script_id: 'AKfycbycEL10az41eLdlBS-BitrTyfj0A27uWHz5j9SpOnO98k0sF7SBW_CN5U-VDRPsPyuQ',
        pair: false,
        pron: 'Дорогой',
    },
];

export const camerasData: Record<number, { from: Vector; cameraLookAt: Vector }> = {
    1: {
        from: {
            x: 0.666,
            y: 1.148,
            z: 5.702,
        },
        cameraLookAt: {
            x: 0.104692,
            y: 0.184622,
            z: 5.023185,
        },
    },
    2: {
        from: {
            x: 0.986,
            y: 1.72,
            z: 6.715,
        },
        cameraLookAt: {
            x: 0.98537,
            y: 0,
            z: 5.343723,
        },
    },
    3: {
        from: {
            x: 2.492,
            y: 5.036,
            z: 7.857,
        },
        cameraLookAt: {
            x: 0.176625,
            y: 0,
            z: 5.099189,
        },
    },
    4: {
        from: {
            x: 10.389,
            y: 7.333,
            z: 14.857,
        },
        cameraLookAt: {
            x: -0.02895,
            y: 0.462683,
            z: -0.44104,
        },
    },
    5: {
        from: {
            x: 4.194,
            y: 3.963,
            z: 9.44,
        },
        cameraLookAt: {
            x: -0.22416,
            y: 0.462683,
            z: -1.03246,
        },
    },
    6: {
        from: {
            x: -1.27,
            y: 2.275,
            z: 5.143,
        },
        cameraLookAt: {
            x: 1.425677,
            y: 0.988924,
            z: -7.929784,
        },
    },
    7: {
        from: {
            x: 0.385,
            y: 1.492,
            z: -2.873,
        },
        cameraLookAt: {
            x: 1.421577,
            y: 0.992137,
            z: -7.930287,
        },
    },
    8: {
        from: {
            x: 3.827,
            y: 1.271,
            z: -3.311,
        },
        cameraLookAt: {
            x: 1.417198,
            y: 0.990486,
            z: -7.930024,
        },
    },
    9: {
        from: { x: 1.453, y: 2.278, z: -5.302 },
        cameraLookAt: {
            x: -0.650339,
            y: 1.001478,
            z: -8.775895,
        },
    },
    10: {
        from: {
            x: -0.074663,
            y: 1.543883,
            z: -8.161812,
        },
        cameraLookAt: {
            x: -0.701672,
            y: 0.98513,
            z: -8.879626,
        },
    },
};
